Autodesk.Revit.DB.FabricationPart.FixDuplicateGUIDs(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Eliminate duplicate or blank part GUIDs by assiging new GUIDs to affected parts.
document:
The document.
ids:
List of element Ids of fabrication parts to fix. Will attempt to fix all parts in the document if none are passed.
Returns:
Returns a list of fabrication part element Ids that were changed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016